vmidentity/sts/src/test/resources/request/valid_bst2.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><ns6:Security xmlns:ns6="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <ns3:Timestamp xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" ns3:Id="_b7f90e72-6c0c-4297-904a-1adc3f8afc7c"><ns3:Created>2012-09-04T16:27:26.987Z</ns3:Created><ns3:Expires>2012-09-04T16:37:26.987Z</ns3:Expires></ns3:Timestamp><ns2:BinarySecurityToken xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" ns1:Id="_9e0abf3b-cadb-4526-ae5d-89ef8be54811">MIICcjCCAdsCAgPoMA0GCSqGSIb3DQEBBQUAMIGAMQswCQYDVQQGEwJVUzESMBAG
A1UECBMJTWlubmVzb3RhMRMwEQYDVQQHEwpNaW5uZXRvbmthMRMwEQYDVQQKEwpt
eSBjb21wYW55MRgwFgYDVQQLEw9teSBvcmdhbml6YXRpb24xGTAXBgNVBAMTEHBy
b21jLTFzLWRoY3AxNjQwHhcNMTIwNTAyMTgzMDIxWhcNMjIwNDMwMTgzMDIxWjCB
gDELMAkGA1UEBhMCVVMxEjAQBgNVBAgTCU1pbm5lc290YTETMBEGA1UEBxMKTWlu
bmV0b25rYTETMBEGA1UEChMKbXkgY29tcGFueTEYMBYGA1UECxMPbXkgb3JnYW5p
emF0aW9uMRkwFwYDVQQDExBwcm9tYy0xcy1kaGNwMTY0MIGfMA0GCSqGSIb3DQEB
AQUAA4GNADCBiQKBgQClqwzhoSuSSu8S+Zt7Bc0LgWtJMNiU1Bjo38sqsq6BZJX+
+DDc9+5+6MBnS6YCWBEzPH3UWQdmFDX0KUCcvCm/Cwcnx6kKhU61t+ZyMNrHVwzX
HUmTMhJbH/zwo63egbgSlOh5Z8sc0Db3Kdh59mjNjfHO9EMsqOMZziuY4a+sVwID
AQABMA0GCSqGSIb3DQEBBQUAA4GBAEaL9gOQ8p8J5CHLPZoU9xFpwWHx1qm4qY67
NDmlCT+lP5sNA7NmY00ydsyCZm0Okrnepj8QMoNI+DJ/La8WMavoa8ZmL4WVLOR5
lp5BxRwIs2eWA9Gfik+T6bxKNlFdOM/wXntFDXm9gZbm7hmaodwXNL8q/gMbagTF
7chcyFxF
</ns2:BinarySecurityToken>
    <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="_3820f9f4-3ec7-405c-9c9d-f88bd375e3f6"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/><ds:Reference URI="#_3b793c06-db60-4001-b9ba-29d54462345b"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>U+/iifG/gF5eBMF5lKLXCvxI6gNGZ0HDaSVkad9uCQ0=</ds:DigestValue></ds:Reference><ds:Reference URI="#_b7f90e72-6c0c-4297-904a-1adc3f8afc7c"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>iwvM2ziIRa3L4855hETfLw/o3yoW8wVMgGN6P+7TzxE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>H9tq85yFh1TM1JT6ncbMFjobrv4GYg8zuBW7/5jqNHesPCwOueuat7wcjo5BTgjKIMk2aq6gwQtoAwcZN56Uor/rBptiNMTHidOJru4p2luSnnssC7T5MSqB1HUZo9yBnYYcTCLZbcs1wNti0UkpEdCAtaZodaGjdQEKqtG13k8=</ds:SignatureValue><ds:KeyInfo><ns6:SecurityTokenReference><ns6:Reference URI="#_9e0abf3b-cadb-4526-ae5d-89ef8be54811" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></ns6:SecurityTokenReference></ds:KeyInfo></ds:Signature></ns6:Security></SOAP-ENV:Header><SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_3b793c06-db60-4001-b9ba-29d54462345b"><RequestSecurityToken xmlns="http://docs.oasis-open.org/ws-sx/ws-trust/200512"><TokenType>urn:oasis:names:tc:SAML:2.0:assertion</TokenType><RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</RequestType><Lifetime><ns3:Created xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2012-09-04T16:27:26.987Z</ns3:Created><ns3:Expires xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2012-09-04T16:28:26.987Z</ns3:Expires></Lifetime><Renewing Allow="true" OK="true"/><Delegatable>false</Delegatable><ns4:ActAs xmlns:ns4="http://docs.oasis-open.org/ws-sx/ws-trust/200802"><saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:saml2p="urn:oasis:names:tc:SAML:2.0:protocol" ID="_6e906821-a03f-4143-a987-a8ebb9218d9c" IssueInstant="2012-09-04T16:26:57.379Z" Version="2.0"><saml2:Issuer Format="urn:oasis:names:tc:SAML:2.0:nameid-format:entity">https://wdc-vum-dev-dhcp187.eng.vmware.com:7444/websso/SAML2/Metadata/csp</saml2:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/><ds:Reference URI="#_6e906821-a03f-4143-a987-a8ebb9218d9c"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xs xsi"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>+IwJvgh7KQE746YJSbAGbajtqGobt7TsCt9IqR57YkI=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>N6mCcR1vRId0flM1N01+VAkvKx2v3JlCxtD8EfHeSl8o08AGrKeYahhL41EywiUPBXq1aA6UKkS5
/ot+A5QDaQu2UV+8PQZFDS20B5GkYVA03ZMghxz8rB/GG/2WkMzyqyNEcXjOm6gqU46zDgfSnE8M
5KsaEiABaeycas0qLdAGi23G5OuokkGSeyAYhvZFxXI6/Ix1itmYMfV7wUb8qWONQbOykNKswUWj
gounCQHBPjnz8ip5IikXKY1g3flmkzCL38Va/UOetJPO+7I2HRYzZ2Raf5m5eMc2oGg5TLvcGiet
vlhO7Gy+yqX20a9H26YzkOUpX+cGTZmTsGTZUg==</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIDMTCCAhkCCQCpraeAXt4HqDANBgkqhkiG9w0BAQUFADBaMQwwCgYDVQQDDANzdHMxDDAKBgNV
BAsMA1ImRDEPMA0GA1UECgwGVk13YXJlMQ4wDAYDVQQHDAVTb2ZpYTEOMAwGA1UECAwFU29maWEx
CzAJBgNVBAYTAkJHMB4XDTEyMDExMDEwMDYzN1oXDTIxMTAwOTEwMDYzN1owWzENMAsGA1UEAwwE
c3RzMTEMMAoGA1UECwwDUiZEMQ8wDQYDVQQKDAZWTVdhcmUxDjAMBgNVBAcMBVNvZmlhMQ4wDAYD
VQQIDAVTb2ZpYTELMAkGA1UEBhMCQkcwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDE
GyhRK1ygL5QibjTrVdpRvSHTaGhskOVLKK4xnoRub9TbI2j1zGgxa7T9oQ6R86Ofg/kvOm+Fzhb8
Jt5shCUKzSweQ2bGa5yjt0kO/FbwE7oxOdV/3XuJbn7fd+xdwdpT+5pFKKjYgdKJmoV3FZEoiB+l
if/IvX0f5pfJHPbUHIiKRIukzdSmg/sfyH4gczw8r67jC51jmD7djZPQ3ySlR59erXr/en3g5hWF
3Szn0p/5EPSCfT6p1UFBDKW28AqD8tLXajN13tOUw1/guSTPmhJfn+nM+6oH2/bjHoPe1B/wGlEh
uAPuuzHpyhxcJ1nMGWJhZPkIQmS0EwKousAPAgMBAAEwDQYJKoZIhvcNAQEFBQADggEBAJHLw/Hh
lxx6KOIflq9W9goav/uGzEGtiKzfFGSZKV3oCcL597Csj669p/02INNg+AzZRo5i2Sjsa3QIuxWp
pee3TmfOb6fKBVTO90UIQddHOeWNOZIGN1zfzpbIuetNfr9vICxhFZo3Y+7MH58mnXUQ4UU2WV3y
m91fcJhyxuYx1lH+fPbbKuJGatOxO6Yj/DEcGcJ6ZuMG+lsgiM2EKy6jPbvnhw/hvv+jzasBmU9h
gBk3tytSE4m0tIMupBVWA5f2JSVZOdJkJSZaYygpnkBYZPpmSQGKwmPcADb2QzpB40yCCK04WLzk
aD6mx9REtLxX+CTzgqNn9Yy9YxIwdwY=</ds:X509Certificate><ds:X509Certificate>MIIDMDCCAhgCCQDpq2xOc2VT+DANBgkqhkiG9w0BAQUFADBaMQwwCgYDVQQDDANzdHMxDDAKBgNV
BAsMA1ImRDEPMA0GA1UECgwGVk13YXJlMQ4wDAYDVQQHDAVTb2ZpYTEOMAwGA1UECAwFU29maWEx
CzAJBgNVBAYTAkJHMB4XDTEyMDExMDEwMDA1MFoXDTIyMDEwNzEwMDA1MFowWjEMMAoGA1UEAwwD
c3RzMQwwCgYDVQQLDANSJkQxDzANBgNVBAoMBlZNd2FyZTEOMAwGA1UEBwwFU29maWExDjAMBgNV
BAgMBVNvZmlhMQswCQYDVQQGEwJCRzCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALDm
uj6862nk/Vge3Khf/cps2W6W7rimia4hl2muWqVwJk7zpNb1fo4X6Gu3dNwEt2GvwS2crbklcH4M
yquQnM7PoNIRBo5eyLtXPXA4KnUlJgaZj11VOYk2046/ftiIK3a5dI2Z6LI2QNVYMzAwSPEXoEui
szvgysG8h9RXFTqABXqX4pALT+J7hOaqXk15uohIgsFWz6IsaWcuTkcLRG0WG21h57ApL+IZ38XV
RsDKdTFOUQPV36lk6rzNmQ8usLYidgOs6Kry79/r0tzHhRVLGne51AbK9qnkUOny6cDuat93thri
vASaRHBiANMa1RCn17Gijunu4aMlAMmbgX0CAwEAATANBgkqhkiG9w0BAQUFAAOCAQEANFXCY8F6
UBN5MOSIJq52fTfNAwicsozLb6309245WFfIYl9grUjQj7axBWIaSW+XoHcKrSDgSDh3Ds7ikmfF
DIQVVkLmfmx/2TjhOoDzphtmyyDsgWI0dwH0iDtKV2KRueQITts3cjqk5pd88g8Kmg09/HEDSx5T
XIMfamCxjvcKCLdnYDGYT6iDzMwsxgWqOs/wMihyTmpUtYUfjQlw1VEzBUGaZmOkxaLXj+WCdanP
uyGzKH8NWy43SSXPbYfhhqP2tvvQ5vg8BCUu8xsDikMD8pRC480KQT7ONEBtJNcfnAHeLAVtxOyP
ab3Hq/zePyznZRd5EN3b8N1l18ibvA==</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature><saml2:Subject><saml2:NameID Format="http://schemas.xmlsoap.org/claims/UPN">Administrator@csp.com</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"><saml2:SubjectConfirmationData InResponseTo="_44b20e5e-cf9c-4f61-ba81-fdbdf6784311" NotOnOrAfter="2012-09-04T16:30:42.378Z" Recipient="http://10.20.103.199:8443/SSO/visl/response"/></saml2:SubjectConfirmation></saml2:Subject><saml2:Conditions NotBefore="2012-09-04T16:25:42.378Z" NotOnOrAfter="2012-09-04T16:30:42.378Z"><saml2:ProxyRestriction Count="0"/><saml2:AudienceRestriction><saml2:Audience>http://10.20.103.199:8443/SSO/visl</saml2:Audience></saml2:AudienceRestriction></saml2:Conditions><saml2:AuthnStatement AuthnInstant="2012-09-04T16:26:57.378Z" SessionIndex="_dbbe874853ad4dc94fc672c7676b9a1a"><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute FriendlyName="surname" Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/surname" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xs:string">csp.com</saml2:AttributeValue></saml2:Attribute><saml2:Attribute FriendlyName="givenName" Name="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/givenname" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xs:string">Administrator</saml2:AttributeValue></saml2:Attribute><saml2:Attribute FriendlyName="userPrincipalName" Name="http://schemas.xmlsoap.org/claims/UPN" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xs:string">Administrator@csp.com</saml2:AttributeValue></saml2:Attribute><saml2:Attribute FriendlyName="Groups" Name="http://rsa.com/schemas/attr-names/2009/01/GroupIdentity" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xs:string">csp.com\Users</saml2:AttributeValue><saml2:AttributeValue xsi:type="xs:string">csp.com\Administrators</saml2:AttributeValue><saml2:AttributeValue xsi:type="xs:string">csp.com\ComponentManager.Administrators</saml2:AttributeValue></saml2:Attribute><saml2:Attribute FriendlyName="Subject Type" Name="http://vmware.com/schemas/attr-names/2011/07/isSolution" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xs:string">false</saml2:AttributeValue></saml2:Attribute></saml2:AttributeStatement></saml2:Assertion></ns4:ActAs><KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/PublicKey</KeyType><SignatureAlgorithm>http://www.w3.org/2001/04/xmldsig-more#rsa-sha256</SignatureAlgorithm><ns3:UseKey xmlns:ns3="http://docs.oasis-open.org/ws-sx/ws-trust/200512" Sig="_3820f9f4-3ec7-405c-9c9d-f88bd375e3f6"/></RequestSecurityToken></SOAP-ENV:Body></SOAP-ENV:Envelope>
